# 母音
vowel_read_dict = {
    "ㅏ": "a",
    "ㅑ": "ya",
    "ㅓ": "eo (o)",
    "ㅕ": "yeo (yo)",
    "ㅗ": "o",
    "ㅛ": "yo",
    "ㅜ": "u",
    "ㅠ": "yu",
    "ㅡ": "eu (u)",
    "ㅣ": "i",
    "ㅔ": "e",  # 本来合成母音だが、合成母音辞書の中でこの文字が出てくるのでここにも書く
    "ㅐ": "e",  # 本来合成母音だが、合成母音辞書の中でこの文字が出てくるのでここにも書く
}

# 子音
consonant_read_dict = {
    "ㄱ": "k/g",
    "ㄴ": "n",
    "ㄷ": "t/d",
    "ㄹ": "l",
    "ㅁ": "m",
    "ㅂ": "p/b",
    "ㅅ": "s",
    "ㅇ": "",
    "ㅈ": "ch/j",
    "ㅊ": "ch",  # 激音
    "ㅋ": "k",  # 激音
    "ㅌ": "t",  # 激音
    "ㅍ": "p",  # 激音
    "ㅎ": "h",
}

# 子音の濃音
strong_consonant_read_dict = {
    "ㄲ": ["kk", "ㄱ"],
    "ㄸ": ["tt", "ㄷ"],
    "ㅃ": ["pp", "ㅂ"],
    "ㅆ": ["ss", "ㅅ"],
    "ㅉ": ["cch", "ㅈ"],
}

# パッチム
patchum_read_dict = {
    "ㄱ": "k",
    "ㅋ": "k",
    "ㄲ": "k",
    "ㄴ": "n",
    "ㅁ": "m",
    "ㅇ": "ng",
    "ㅂ": "p",
    "ㅍ": "p",
    "ㄹ": "l",
    "ㄷ": "ッ",
    "ㅅ": "ッ",
    "ㅈ": "ッ",
    "ㅊ": "ッ",
    "ㅌ": "ッ",
    "ㅎ": "ッ",
    "ㅆ": "ッ",
}

# 合成母音を分解
diphthong_read_dict = {
    "ㅐ": {
        "symbol": ["ㅏ", "ㅣ"],
        "reading": "e",
    },
    "ㅔ": {
        "symbol": ["ㅓ", "ㅣ"],
        "reading": "e",
    },
    "ㅒ": {
        "symbol": ["ㅑ", "ㅣ"],
        "reading": "ye",
    },
    "ㅖ": {
        "symbol": ["ㅕ", "ㅣ"],
        "reading": "ye",
    },
    "ㅘ": {
        "symbol": ["ㅗ", "ㅏ"],
        "reading": "wa",
    },
    "ㅝ": {
        "symbol": ["ㅜ", "ㅓ"],
        "reading": "wo",
    },
    "ㅞ": {
        "symbol": ["ㅜ", "ㅔ"],
        "reading": "we",
        "note": "ㅔも合成母音",
    },
    "ㅙ": {
        "symbol": ["ㅗ", "ㅐ"],
        "reading": "we",
        "note": "ㅐも合成母音",
    },
    "ㅚ": {
        "symbol": ["ㅗ", "ㅣ"],
        "reading": "we",
        "note": "本来 o + i だが、例外としてweになる",
    },
    "ㅟ": {
        "symbol": ["ㅜ", "ㅣ"],
        "reading": "wi",
    },
    "ㅢ": {
        "symbol": ["ㅡ", "ㅣ"],
        "reading": "wi",
    },
}
